/*=========================================================

	mfctrltypes.h

	共用する型宣言。

=========================================================*/
#ifndef MFCTRLTYPES_H
#define MFCTRLTYPES_H

#include "mfcommontypes.h"

/*=========================================================
	コントロールメッセージ
=========================================================*/
typedef enum {
	MF_CM_INIT     = 0x00000001,
	MF_CM_LABEL    = 0x00000002,
	MF_CM_INFO     = 0x00000004,
	MF_CM_PROC     = 0x00000008,
	MF_CM_TERM     = 0x00000010,
	MF_CM_WAIT     = 0x00000020, /* コントロールに対して処理を待つよう指示する。ダイアログと拡張関数の実行時に送られる。*/
	MF_CM_CONTINUE = 0x00000040  /* コントロールに対して処理を再開するよう指示する。MF_CM_WAITが終了したときに1度だけ送られる。*/
} MfCtrlMessage;

/*=========================================================
	コントロールプロシージャ
=========================================================*/
typedef int ( *MfControl )( MfMessage message, const char *label, void *var, void *arg, void *ex );

#endif
